ERP DEV.WMS/src/Enums/вмс_ВидыСравненияВНастройках/вмс_ВидыСравненияВНастройках.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>вмс_ВидыСравненияВНастройках</name>
  <enumValues>
    <name>Равно</name>
  </enumValues>
  <enumValues>
    <name>Больше</name>
  </enumValues>
  <enumValues>
    <name>Меньше</name>
  </enumValues>
  <enumValues>
    <name>ВСписке</name>
  </enumValues>
  <enumValues>
    <name>Содержит</name>
  </enumValues>
  <enumValues>
    <name>БольшеРавно</name>
  </enumValues>
  <enumValues>
    <name>МеньшеРавно</name>
  </enumValues>
</mdclass:Enum>

ERP DEV.WMS/src/Enums/вмс_ВидыСравненияВНастройках/ManagerModule.bsl
Функция ПолучитьВидСравненияКомпоновщикаПоВидуСравненияWMS(ВидСравнения) Экспорт

	Если ВидСравнения = Перечисления.вмс_ВидыСравненияВНастройках.Равно Тогда
		Возврат ВидСравненияКомпоновкиДанных.Равно;
		
	ИначеЕсли ВидСравнения = Перечисления.вмс_ВидыСравненияВНастройках.Больше Тогда
		Возврат ВидСравненияКомпоновкиДанных.Больше;
		
	ИначеЕсли ВидСравнения = Перечисления.вмс_ВидыСравненияВНастройках.Меньше Тогда
		Возврат ВидСравненияКомпоновкиДанных.Меньше;
		
	ИначеЕсли ВидСравнения = Перечисления.вмс_ВидыСравненияВНастройках.ВСписке Тогда
		Возврат ВидСравненияКомпоновкиДанных.ВСписке;
		
	ИначеЕсли ВидСравнения = Перечисления.вмс_ВидыСравненияВНастройках.Содержит Тогда
		Возврат ВидСравненияКомпоновкиДанных.Содержит;
		
	ИначеЕсли ВидСравнения = Перечисления.вмс_ВидыСравненияВНастройках.БольшеРавно Тогда
		Возврат ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
		
	ИначеЕсли ВидСравнения = Перечисления.вмс_ВидыСравненияВНастройках.МеньшеРавно Тогда
		Возврат ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;	
	КонецЕсли;		
	
	
КонецФункции // ПолучитьВидСравненияКомпоновщикаПоВидуСравненияWMS()

Функция ПолучитьВидСравненияЗапросомПоВидуСравненияWMS(ВидСравнения) Экспорт

	Если ВидСравнения = Перечисления.вмс_ВидыСравненияВНастройках.Равно Тогда
		Возврат "=";
		
	ИначеЕсли ВидСравнения = Перечисления.вмс_ВидыСравненияВНастройках.Больше Тогда
		Возврат ">";
		
	ИначеЕсли ВидСравнения = Перечисления.вмс_ВидыСравненияВНастройках.Меньше Тогда
		Возврат "<";
		
	ИначеЕсли ВидСравнения = Перечисления.вмс_ВидыСравненияВНастройках.ВСписке Тогда
		Возврат "В";
		
	ИначеЕсли ВидСравнения = Перечисления.вмс_ВидыСравненияВНастройках.Содержит Тогда
		Возврат "ПОДОБНО";
		
	ИначеЕсли ВидСравнения = Перечисления.вмс_ВидыСравненияВНастройках.БольшеРавно Тогда
		Возврат ">=";
		
	ИначеЕсли ВидСравнения = Перечисления.вмс_ВидыСравненияВНастройках.МеньшеРавно Тогда
		Возврат "<=";	
	КонецЕсли;		
	
	
КонецФункции // ПолучитьВидСравненияКомпоновщикаПоВидуСравненияWMS()
